Tekla.Structures.ModelInternal.Dstv.DstvReferenceType
Dimension reference type

Tekla.Structures.ModelInternal.Dstv.DstvReferenceType.NO_VALUE
Same as previous reference

Tekla.Structures.ModelInternal.Dstv.DstvReferenceType.o
Top edge

Tekla.Structures.ModelInternal.Dstv.DstvReferenceType.s
Reference axis

Tekla.Structures.ModelInternal.Dstv.DstvReferenceType.u
Bottom edge